<!DOCTYPE html>
<html lang="en-us">
<head>
<meta charset="utf-8"/>
<meta name="author" content="David Bold, Steffen Lohmannm, Stefan Negru"/>
<meta name="keywords" content="owl, protege, vowl, visual notation, web ontology language, ontology visualization, ontologies, semantic web" />
<meta name="description" content="ProtegeVOWL: VOWL plugin for protégé." />
<meta name="robots" content="index,follow"/>
<link rel="stylesheet" type="text/css" href="css/pagestyle.css" />
<link rel="icon" href="favicon.ico" type="image/x-icon" />
<title>VOWL Plugin for Prot&eacute;g&eacute;</title>
</head>
<body>
<div id="wrapper">
  <header>
    <h1><span>Prot&eacute;g&eacute;VOWL</span>: VOWL Plugin for Prot&eacute;g&eacute;</h1>
    <span id="visualHome"><a href="http://purl.org/vowl/">VOWL Specification &raquo;</a></span> </header>
  <hr>
  <p>Prot&eacute;g&eacute;VOWL is a Prot&eacute;g&eacute; plugin for the user-oriented visualization of ontologies. It implements the <a href="http://purl.org/vowl/">Visual Notation for OWL Ontologies (VOWL)</a> by providing graphical depictions for elements of the Web Ontology Language (OWL) that are combined to a force-directed graph layout representing the ontology. Prot&eacute;g&eacute;VOWL is based on <a href="http://purl.org/vowl/v2/">VOWL 2.0</a>, which focuses on the visualization of the ontology schema (i.e. the classes, properties and datatypes, sometimes called TBox), while it does not consider individuals and data values (the ABox).</p>
  <p>Note that the current version of Prot&eacute;g&eacute;VOWL does not implement all visual elements defined in the specification of VOWL 2.0. Further elements will be added to the next version of Prot&eacute;g&eacute;VOWL.</p>
  <hr>
  <p><strong>One-sentence installation instructions: </strong>Download JAR file, copy it to <em>plugins</em> folder of Prot&eacute;g&eacute;, activate the plugin via <em>Window &rarr; Tabs &rarr; VOWL</em>.</p>
  <hr>
  <section>
    <h2>Installation of Prot&eacute;g&eacute;VOWL</h2>
    <ol>
      <li>Install Prot&eacute;g&eacute; (if not already installed)</li>
      <li>Copy JAR file to the <em>plugins</em> folder of Prot&eacute;g&eacute;</li>
      <li>Start Prot&eacute;g&eacute; and activate the VOWL plugin</li>
      <li>Verify Installation</li>
      <li>Customize Prot&eacute;g&eacute;VOWL</li>
    </ol>
    <hr>
    <article>
      <h3>1. Install Prot&eacute;g&eacute; (if not already installed)</h3>
      <p>Prot&eacute;g&eacute;VOWL has been developed for the ontology editor <a href="http://protege.stanford.edu/">Prot&eacute;g&eacute;</a> that needs to be downloaded and installed first. Prot&eacute;g&eacute;VOWL requires at least version 4 of Prot&eacute;g&eacute; Desktop that is available at <a href="http://protege.stanford.edu">protege.stanford.edu</a> free of charge.</p>
    </article>
    <article>
      <h3>2. Copy JAR file to the <em>plugins</em> folder of Prot&eacute;g&eacute;</h3>
      <p>Prot&eacute;g&eacute;VOWL consists of a JAR file that can be downloaded here:
      <p id="down"><a href="resources/org.visualdataweb.vowl.jar">Download Prot&eacute;g&eacute;VOWL plugin (beta 0.1) &darr;</a></p>
      <p>The JAR file needs to be copied to the plugin folder of Prot&eacute;g&eacute;, i.e. <em>&lt;installation_path&gt;\Protege_4.x\plugins\</em>.</p>
    </article>
    <article>
      <h3>3. Start Prot&eacute;g&eacute; and activate the VOWL plugin</h3>
      <p>After Prot&eacute;g&eacute; has been started, the VOWL plugin can be activated via the <em>Window</em> menu (see <a href="#fig1">Figure 1</a>).</p>
      <figure id="fig1"> <img style="width:80%" src="resources/activateVOWLplugin.png" alt="Activate VOWL plugin"/>
        <figcaption>Figure 1. Activate the VOWL plugin in Prot&eacute;g&eacute;.</figcaption>
      </figure>
    </article>
    <article>
      <h3>4. Verify Installation</h3>
      <p>A new tab entitled <em>VOWL</em> is shown next to the other tabs in Prot&eacute;g&eacute; (see <a href="#fig2">Figure 2</a>).</p>
      <p>If this tab is selected, the active ontology is visualized using the VOWL notation. If nothing is visualized, an ontology needs first to be opened with Prot&eacute;g&eacute; (e.g. by selecting <em>Open from URI...</em> in the <em>File</em> menu and entering the URI http://purl.org/muto/core#).
        <figure id="fig2"> <img style="width:80%" src="resources/viewsVOWLplugin.png" alt="step3 installation"/>
          <figcaption>Figure 2. User interface of Prot&eacute;g&eacute;VOWL.</figcaption>
        </figure>
    </article>
    <article>
      <h3>5. Customize Prot&eacute;g&eacute;VOWL</h3>
      <p>The user interface of Prot&eacute;g&eacute;VOWL is structured as follows (see <a href="#fig2">Figure 2</a>):</p>
      <ul>
        <li><strong>VOWL Viewer - </strong>displays the ontology visualization;</li>
        <li><strong>VOWL Sidebar - </strong>lists details about the selected element;</li>
        <li><strong>VOWL Controls - </strong>allow to adapt the force-directed graph layout.</li>
      </ul>
      <p>The user interface can be costumized with the small icons in the upper right of the views. The views can also be individually (de-)activated via the <em>Window</em> menu (<em>Window &rarr; Views &rarr; Ontology views &rarr; VOWL Controls/Sidebar/Viewer</em>).</p>
    </article>
    <hr>
    <p>ProtégéVOWL is released under the MIT license
    <p>
    <p>Copyright (c) 2014 David Bold, Steffen Lohmann, Stefan Negru</p>
    <p>Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:</p>
    <p>The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.</p>
    <p>THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.</p>
  </section>
  <hr />
  <footer>
    <p> <span><a rel="license" href="http://creativecommons.org/licenses/by/4.0/"><img alt="Creative Commons License" style="border-width:0" src="http://i.creativecommons.org/l/by/4.0/88x31.png" /></a></span> <span>This page is licensed under the <a href="http://creativecommons.org/licenses/by/4.0/">Creative Commons Attribution 4.0</a> license. You are free to copy, distribute, transmit, remix, or adapt the work, as long as you reference the work and its authors.</span> </p>
  </footer>
</div>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-12619410-19', 'visualdataweb.org');
  ga('send', 'pageview');
</script>
</body>
</html>